Testing
 Review process
 Theme success
 Theme revenue share
 Shopify Theme Store
 The Shopify Theme Store is one of the first stops in a merchant’s journey to launching their online store. With flexible pricing and smart marketing features, building themes for the Shopify Theme Store is a great way to build your business while helping millions of merchants build theirs.
 Ready to start selling themes on Shopify?
 The Shopify Theme Store is now open to new developers. Find out how the new review process works and how to prepare your theme for submission.
 
 Target your theme to a specific industry—from fashion to automotive
 Build custom features tailored to specific business categories, and we'll surface your theme to merchants who need it most.
 Grow your business
 With flexible pricing and a zero percent revenue share model for the first $1M USD earned, Shopify is the most lucrative platform to sell and scale themes.
 1. Get to know our requirements
 The first step to becoming a Shopify Theme Partner is to get familiar with our Theme Store requirements. Our checklist covers everything from technical and performance requirements to theme design and user experience.
 Caution
 Themes must meet all of our requirements to be published in the Shopify Theme Store. If your theme is missing any requirements, then your submission will be rejected and you will need to make further changes to your theme before it can be resubmitted.
 2. Test your theme
 To ensure that your theme contains the required Shopify features, and to ensure that it's flexible, resilient, and performant, you should test it before submission.
 3. Submit your theme
 When you’re ready to share your theme, learn about our review process and how to submit your theme to the Shopify Theme Store. We’ll help you craft a Theme Store listing so that merchants can understand the full potential of your theme.
 4. Grow your theme business
 After you're published on the Shopify Theme Store, learn how to make your theme more successful by supporting your theme, keeping it up to date, and managing merchant reviews. You can download the brand assets that you need to promote your theme in your own marketing materials.
 Tip
 New to Shopify themes? Start here
 5. Learn about theme revenues
 For the first $1,000,000 USD you make each year on theme sales in the Shopify Theme Store, you pay 0% revenue share. For additional sales over $1,000,000 USD, you pay 15% revenue share until the end of the year, when your revenue share resets to 0% again. Learn how revenue share works for themes sold through the Shopify Theme Store.
 Was this section helpful?
 YesNo
 ON THIS PAGE
 1. Get to know our requirements
 2. Test your theme
 3. Submit your theme
 4. Grow your theme business
 5. Learn about theme revenues
