Overview
 Marketing
 Overview
 Marketing externally
 Overview
 Writing a press release
 Brand asset guidance
 Marketing internally
 Managing app reviews
 Supporting your app
 Tracking app usage
 App listing visibility
 App revenue share
 Data protection
 App Store ads
 Security
 Writing a press release for your app
 Although receiving positive reviews is one of the best ways to promote your app, you can also publish press releases to help get your product noticed.
 Press release guidelines
 Before you distribute a press release about your app, make sure that you reach out to press@shopify.com and let us know! If you will be mentioning Shopify, then we will need to review the release and share it with our legal team.
 The review process can take up to a week to complete, so we recommend reaching out with your final press release as soon as possible. If you have any questions about the process or your release, please reach out to press@shopify.com and we’ll get back to you as soon as we can.
 Press release template
 You can follow this paragraph-by-paragraph template to write an effective press release:
 A HEADLINE THAT IS CLEAR AND TO THE POINT
 CITY, STATE, DATE - The first paragraph of your release is the most important. It should have a short summary of what you are announcing and include all critical information so that if someone only read this paragraph, they would know all major details. Typically it’s best to avoid phrasing like “excited to announce,” as that can be a bit overdone.
 The second paragraph of your release can go into a bit more detail, perhaps providing background information or additional context needed.
 “This is the part of your release where you should have a quote from an executive at your company. The quote should include content commenting on the significance of the announcement. The quote can provide color to the announcement that would otherwise not be included in the fact-based release.”
 This paragraph, if needed, can provide even more detail or even could be a chart that goes more into the features, pricing or availability specifics.
 “Here’s another place for a quote, perhaps from a partner or someone else at a different company who is commenting on the exciting nature of this announcement.”
 For your last paragraph, you should include a call to action such as to visit the website for additional details.
 About Your Company
 You should include your boilerplate at the bottom of your release.
 Was this section helpful?
 YesNo
 ON THIS PAGE
 Press release guidelines
 Press release template
 Updates & News
 Developer changelog
 Partner blog
