Section blocks
 Theme blocks
 Overview
 Block schema
 Developer preview
 App blocks
 Section groups
 Config
 Locales
 Settings
 Trust and security
 Migrating to Online Store 2.0
 Troubleshooting
 Theme Store
 Theme blocks developer preview
 The Theme blocks developer preview gives you access to the following new platform features:
 Support for reusable block Liquid files located in the /blocks folder of the theme
 Nesting blocks up to eight levels deep using the {% content_for ‘blocks’ %} Liquid tag
 Multiple presets that showcase settings variations of the same block. Merchants can add these in the theme editor using the block picker.
 In addition to the theme blocks documentation, consult the reference theme, which puts all of these concepts together, and install the latest release. Please provide feedback via the GitHub Discussion Board.
 Access the developer preview
 Log in to your Partner account, or sign up for an account if you don't already have one.
 From your Partner Dashboard, click Stores.
 Click Add store > Create development store.
 In the Store purpose section, select Create a store to test and build.
 In the Store name section, enter a name for your store.
 In the Build version section, select the Theme blocks developer preview from the drop-down list.
 Under Data and configurations, choose whether to start with an empty store, or with a store that's populated with test data generated by Shopify.
 Click Create development store.
 Download and install the latest release of the theme blocks reference theme on your development store.
 Note
 Development stores that use a developer preview can't be transferred to a merchant.
 Resources
 Theme blocks
 Learn about theme blocks, a way to create reusable modules for structuring content within sections.
 Reference theme
 Explore Shopify's reference theme, built to support theme blocks.
 Was this section helpful?
 YesNo
 ON THIS PAGE
 Access the developer preview
 Resources
 Updates & News
 Developer changelog
 Partner blog
